import { Message } from '@entities';

export const MESSAGES_MOCK_DATA: Array<Message> = [
    {
        text: 'Я думаю о чуде, свидетелями которого мы были.',
        time: '14:00',
        outgoing: true,
    },
    {
        text: 'Это ты был свидетелем чуда. Я был свидетелем странного события.',
        time: '14:01',
        outgoing: false,
    },
    {
        text: 'А ты знаешь, что такое чудо?',
        time: '14:02',
        outgoing: true,
    },
    {
        text: 'Деяние Бога.',
        time: '14:03',
        outgoing: false,
    },
    {
        text: 'А что такое – деяние Бога?',
        time: '14:04',
        outgoing: true,
    },
    {
        text: 'Я думаю – это когда Бог делает невозможное возможным. И мне жаль говорить это, Джулс, но я не считаю, что случившееся сегодня утром подпадает под это определение.',
        time: '14:05',
        outgoing: false,
    },
    {
        text: 'Неужели ты не понимаешь, Винсент – я совсем не об этом говорю. Ты судишь о вещах с неверной точки зрения. Не в этом смысл. Бог может остановить пули, он может превратить Кока-Колу в Пепси-Колу или найти ключи от моей машины. Нельзя судить о таких вещах, основываясь только на их значительности. Совершенно несущественно, является ли происшедшее с нами чудом по определению. Существенно другое: я почувствовал присутствие Бога, и значит, Он был там.',
        time: '14:06',
        outgoing: true,
    },
    {
        text: 'Но почему?',
        time: '14:07',
        outgoing: false,
    },
    {
        text: 'Да что ты пристал ко мне! Откуда мне знать, почему? Но успокоиться и забыть об этом я не могу.',
        time: '14:08',
        outgoing: true,
    },
    {
        text: 'То есть ты серьезно решил уйти?',
        time: '14:09',
        outgoing: false,
    },
    {
        text: 'Серьезней не бывает.',
        time: '14:10',
        outgoing: true,
    },
];
